
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_id.id: Refreshing state... [id=ZP7UUg]
module.dalle-bot.data.google_iam_policy.noauth: Reading...
google_project.project: Refreshing state... [id=projects/discord-bots64fed452]
module.dalle-bot.data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
google_project_service.service["compute.googleapis.com"]: Refreshing state... [id=discord-bots64fed452/compute.googleapis.com]
google_service_account_iam_binding.run-service-agent: Refreshing state... [id=projects/discord-bots64fed452/serviceAccounts/941092486297-compute@developer.gserviceaccount.com/roles/run.serviceAgent]
google_project_iam_member.serverless_robot_prod_roles["roles/run.serviceAgent"]: Refreshing state... [id=discord-bots64fed452/roles/run.serviceAgent/serviceAccount:service-941092486297@serverless-robot-prod.iam.gserviceaccount.com]
google_project_iam_member.joshua_thompsonja_roles["roles/artifactregistry.writer"]: Refreshing state... [id=discord-bots64fed452/roles/artifactregistry.writer/user:joshua@thompsonja.com]
google_secret_manager_secret.github-key: Refreshing state... [id=projects/discord-bots64fed452/secrets/github-private-repo-key]
google_project_iam_member.joshua_thompsonja_roles["roles/viewer"]: Refreshing state... [id=discord-bots64fed452/roles/viewer/user:joshua@thompsonja.com]
google_project_iam_member.serverless_robot_prod_roles["roles/artifactregistry.reader"]: Refreshing state... [id=discord-bots64fed452/roles/artifactregistry.reader/serviceAccount:service-941092486297@serverless-robot-prod.iam.gserviceaccount.com]
google_project_iam_member.cloudbuild_roles["roles/run.admin"]: Refreshing state... [id=discord-bots64fed452/roles/run.admin/serviceAccount:941092486297@cloudbuild.gserviceaccount.com]
google_project_service.service["firestore.googleapis.com"]: Refreshing state... [id=discord-bots64fed452/firestore.googleapis.com]
google_project_iam_member.cloudbuild_roles["roles/cloudbuild.builds.builder"]: Refreshing state... [id=discord-bots64fed452/roles/cloudbuild.builds.builder/serviceAccount:941092486297@cloudbuild.gserviceaccount.com]
google_project_service.service["cloudbilling.googleapis.com"]: Refreshing state... [id=discord-bots64fed452/cloudbilling.googleapis.com]
google_project_service.service["containerregistry.googleapis.com"]: Refreshing state... [id=discord-bots64fed452/containerregistry.googleapis.com]
google_project_service.service["firebase.googleapis.com"]: Refreshing state... [id=discord-bots64fed452/firebase.googleapis.com]
google_project_service.service["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=discord-bots64fed452/cloudresourcemanager.googleapis.com]
google_project_service.service["iam.googleapis.com"]: Refreshing state... [id=discord-bots64fed452/iam.googleapis.com]
google_project_service.service["run.googleapis.com"]: Refreshing state... [id=discord-bots64fed452/run.googleapis.com]
google_project_service.service["artifactregistry.googleapis.com"]: Refreshing state... [id=discord-bots64fed452/artifactregistry.googleapis.com]
google_project_service.service["secretmanager.googleapis.com"]: Refreshing state... [id=discord-bots64fed452/secretmanager.googleapis.com]
google_project_service.service["serviceusage.googleapis.com"]: Refreshing state... [id=discord-bots64fed452/serviceusage.googleapis.com]
google_project_service.service["cloudbuild.googleapis.com"]: Refreshing state... [id=discord-bots64fed452/cloudbuild.googleapis.com]
google_project_iam_member.gcp_sa_roles["roles/cloudbuild.serviceAgent"]: Refreshing state... [id=discord-bots64fed452/roles/cloudbuild.serviceAgent/serviceAccount:service-941092486297@gcp-sa-cloudbuild.iam.gserviceaccount.com]
google_storage_bucket.cloud-build-bucket: Refreshing state... [id=discord-bots64fed452_cloudbuild]
google_monitoring_notification_channel.email-owner: Refreshing state... [id=projects/discord-bots64fed452/notificationChannels/1513593783312082253]
google_project_iam_member.compute_roles["roles/run.admin"]: Refreshing state... [id=discord-bots64fed452/roles/run.admin/serviceAccount:941092486297-compute@developer.gserviceaccount.com]
google_secret_manager_secret_iam_binding.github-access: Refreshing state... [id=projects/discord-bots64fed452/secrets/github-private-repo-key/roles/secretmanager.secretAccessor]
google_service_account_iam_binding.admin-account-iam: Refreshing state... [id=projects/discord-bots64fed452/serviceAccounts/941092486297-compute@developer.gserviceaccount.com/roles/iam.serviceAccountUser]
time_sleep.artifact_registry_api_enabling: Refreshing state... [id=2023-04-01T19:52:56Z]
google_artifact_registry_repository.artifact-repo: Refreshing state... [id=projects/discord-bots64fed452/locations/us-east1/repositories/services]
module.dalle-bot.google_logging_metric.error_logging_metric: Refreshing state... [id=dalle_errors]
module.dalle-bot.google_service_account.bot-service-account: Refreshing state... [id=projects/discord-bots64fed452/serviceAccounts/dalle-sa@discord-bots64fed452.iam.gserviceaccount.com]
module.dalle-bot.google_secret_manager_secret.bot-key: Refreshing state... [id=projects/discord-bots64fed452/secrets/dalle-key]
module.dalle-bot.google_secret_manager_secret.bot-secrets["openai-api-secret"]: Refreshing state... [id=projects/discord-bots64fed452/secrets/openai-api-secret]
module.dalle-bot.google_secret_manager_secret_iam_binding.bot-secrets-writer["bot-key"]: Refreshing state... [id=projects/discord-bots64fed452/secrets/dalle-key/roles/secretmanager.secretVersionManager]
module.dalle-bot.google_secret_manager_secret_iam_binding.bot-secrets-writer["openai-api-secret"]: Refreshing state... [id=projects/discord-bots64fed452/secrets/openai-api-secret/roles/secretmanager.secretVersionManager]
module.dalle-bot.google_secret_manager_secret_iam_binding.bot-secrets-access["openai-api-secret"]: Refreshing state... [id=projects/discord-bots64fed452/secrets/openai-api-secret/roles/secretmanager.secretAccessor]
module.dalle-bot.google_service_account_iam_binding.bot-iam-binding: Refreshing state... [id=projects/discord-bots64fed452/serviceAccounts/dalle-sa@discord-bots64fed452.iam.gserviceaccount.com/roles/iam.serviceAccountUser]
module.dalle-bot.google_secret_manager_secret_iam_binding.bot-secrets-access["bot-key"]: Refreshing state... [id=projects/discord-bots64fed452/secrets/dalle-key/roles/secretmanager.secretAccessor]
module.dalle-bot.google_secret_manager_secret_iam_binding.bot-secrets-viewer["openai-api-secret"]: Refreshing state... [id=projects/discord-bots64fed452/secrets/openai-api-secret/roles/secretmanager.viewer]
module.dalle-bot.google_project_iam_member.bot-role["roles/logging.logWriter"]: Refreshing state... [id=discord-bots64fed452/roles/logging.logWriter/serviceAccount:dalle-sa@discord-bots64fed452.iam.gserviceaccount.com]
module.dalle-bot.google_secret_manager_secret_iam_binding.bot-secrets-viewer["bot-key"]: Refreshing state... [id=projects/discord-bots64fed452/secrets/dalle-key/roles/secretmanager.viewer]
module.dalle-bot.google_cloud_run_service.service: Refreshing state... [id=locations/us-east1/namespaces/discord-bots64fed452/services/dalle]
module.dalle-bot.google_cloud_run_service_iam_policy.noauth: Refreshing state... [id=v1/projects/discord-bots64fed452/locations/us-east1/services/dalle]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_project_iam_member.joshua_thompsonja_roles["roles/cloudbuild.builds.editor"] will be created
  + resource "google_project_iam_member" "joshua_thompsonja_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:joshua@thompsonja.com"
      + project = "discord-bots64fed452"
      + role    = "roles/cloudbuild.builds.editor"
    }

  # module.dalle-bot.google_cloud_run_service.service will be updated in-place
  ~ resource "google_cloud_run_service" "service" {
        id                         = "locations/us-east1/namespaces/discord-bots64fed452/services/dalle"
        name                       = "dalle"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ metadata {
              ~ labels      = {
                  - "run.googleapis.com/startupProbeType" = "Default" -> null
                }
                # (2 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.dalle-bot.google_cloudbuild_trigger.service-trigger will be created
  + resource "google_cloudbuild_trigger" "service-trigger" {
      + create_time        = (known after apply)
      + filename           = "cloudbuild.yaml"
      + id                 = (known after apply)
      + include_build_logs = "INCLUDE_BUILD_LOGS_WITH_STATUS"
      + included_files     = [
          + "dalle/**",
        ]
      + location           = "global"
      + name               = "dalle-trigger"
      + project            = "discord-bots64fed452"
      + substitutions      = {
          + "_APP"  = "dalle"
          + "_ZONE" = "us-east1"
        }
      + trigger_id         = (known after apply)

      + github {
          + name  = "discordbots"
          + owner = "thompsonja"

          + push {
              + branch = "main"
            }
        }
    }

  # module.dalle-bot.google_monitoring_alert_policy.error_logging_alert_policy will be created
  + resource "google_monitoring_alert_policy" "error_logging_alert_policy" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "dalle Error Alert"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = [
          + "projects/discord-bots64fed452/notificationChannels/1513593783312082253",
        ]
      + project               = "discord-bots64fed452"

      + alert_strategy {
          + auto_close = "3600s"
        }

      + conditions {
          + display_name = "Error logs"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = "metric.type=\"logging.googleapis.com/user/dalle_errors\" AND resource.type=\"cloud_run_revision\""
              + threshold_value = 0.5

              + aggregations {
                  + alignment_period   = "600s"
                  + per_series_aligner = "ALIGN_SUM"
                }
            }
        }
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>